# Data Science tools and Techniques
# Assignment I

# Assignment: Pandas Operations

In [8]:
# Question 1:
# Consider a scenario where you have two separate dictionaries, sales and expenses, 
# each representing the quarterly sales and expenses of a company. 
# The data is organized with respect to different products. Create a Pandas DataFrame named financial_data by combining these two dictionaries.
# Set appropriate row and column labels. Finally, print the DataFrame.

In [9]:
sales = {"jan" : [9000,1000,3000],
         "feb" : [5000,3000,1000],
         "mar" : [1000,4000,2000],
         "apr" : [5000,4000,6000]
        }
sales

{'jan': [9000, 1000, 3000],
 'feb': [5000, 3000, 1000],
 'mar': [1000, 4000, 2000],
 'apr': [5000, 4000, 6000]}

In [10]:
expenses = {"jan" : [3000,1000,2000],
            "feb" : [4000,2000,1000],
            "mar" : [7000,3000,2000],
            "apr" : [4000,2000,1000]
           }
expenses

{'jan': [3000, 1000, 2000],
 'feb': [4000, 2000, 1000],
 'mar': [7000, 3000, 2000],
 'apr': [4000, 2000, 1000]}

In [11]:
import pandas as pd
sales_df = pd.DataFrame(sales, index = ["p1", "p2", "p3"])
sales_df

     jan   feb   mar   apr
p1  9000  5000  1000  5000
p2  1000  3000  4000  4000
p3  3000  1000  2000  6000

In [12]:
expenses_df = pd.DataFrame(sales, index = ["p1", "p2", "p3"])
expenses_df

     jan   feb   mar   apr
p1  9000  5000  1000  5000
p2  1000  3000  4000  4000
p3  3000  1000  2000  6000

In [13]:
financial_data = pd.concat([sales_df, expenses_df], keys = ["Sales", "Expenses"],axis=1)
financial_data

# axis = 1 (concate along column -> means concate left side)
# axis = 0 (concate along row    -> means concate below

   Sales                   Expenses
     jan   feb   mar   apr      jan   feb   mar   apr
p1  9000  5000  1000  5000     9000  5000  1000  5000
p2  1000  3000  4000  4000     1000  3000  4000  4000
p3  3000  1000  2000  6000     3000  1000  2000  6000

In [14]:
# Question 2:
# Now, imagine that you have a DataFrame named employee_data containing information about employees, 
# such as their names, ages, and departments. Your task is to filter this DataFrame to display only the
# employees who are older than 30 years. Write the code to achieve this and print the resulting DataFrame.

In [15]:
import pandas as pd
employee_data = pd.DataFrame({"emp_names": ["ram","shyam", "sita","nikki"], "ages":[37,30,35, 24], "departments":["sales", "purchase","food", "hr"]})
employee_data

  emp_names  ages departments
0       ram    37       sales
1     shyam    30    purchase
2      sita    35        food
3     nikki    24          hr

In [16]:
employee_data.loc[employee_data['ages'] > 30]

  emp_names  ages departments
0       ram    37       sales
2      sita    35        food

In [17]:
# to show only emp_names column 

employee_data.loc[employee_data['ages'] > 30, ['emp_names']]

  emp_names
0       ram
2      sita

In [18]:
# Question 3:
# In a hypothetical scenario, you have a DataFrame named sales_data that represents the monthly sales figures for different products.
# Your goal is to calculate and print the total sales for each product across all months.
# Write the code to accomplish this.

In [19]:
sales_data = pd.DataFrame({"jan": [1000, 2000, 3000], 
                           "feb": [5000, 2000, 1000], 
                           "mar": [7000, 2000, 1000]}, 
                          index=["p1", "p2", "p3"])

# Add a new column for total sales
sales_data['total'] = sales_data.sum(axis=1)
sales_data

     jan   feb   mar  total
p1  1000  5000  7000  13000
p2  2000  2000  2000   6000
p3  3000  1000  1000   5000

# question 3 : alternative method (using groupby)

In [20]:

# Create a DataFrame named sales_data with monthly sales figures for different products
data = {
    'Product': ['Product A', 'Product B', 'Product A', 'Product B'],
    'Month': ['January', 'January', 'February', 'February'],
    'Sales': [10000, 15000, 12000, 18000]
}

sales_data = pd.DataFrame(data)
print(sales_data)
# Calculate and print the total sales for each product across all months
total_sales_per_product = sales_data.groupby('Product')['Sales'].sum()
print(total_sales_per_product)

     Product     Month  Sales
0  Product A   January  10000
1  Product B   January  15000
2  Product A  February  12000
3  Product B  February  18000
Product
Product A    22000
Product B    33000
Name: Sales, dtype: int64